package Method;

/**
 * @ClassName methodDefine
 * @Description TODO
 * @Author jonas.ao
 * @Date 2020/2/7 17：29
 * Project JavaTest
 * @Version 1.0
 **/

/**
 * 方法其实就是若干语句的功能集合
 * 方法===工厂
 * 牛奶工厂     原料：奶牛 饲料 水
 * 产出：奶制品
 * <p>
 * <p>
 * 参数（原料）：就是进入方法的数据
 * 返回值（产出物）就是从方法中出来的数据
 * 定义方法的完整格式：
 * 修饰符  返回值类型  方法名称（参数类型 参数名称，....){
 * 方法体
 * return 返回值；
 * }
 * <p>
 * 返回值类型：也就是方法最终产生的数据结果的类型
 * 方法名称：小驼峰 方法的名字
 * 参数类型：进入方法的数据是什么类型
 * 参数名称：进入方法的数据对应的变量名称
 * 方法体：方法需要实现的功能
 * return：1：停止当前的方法。2：将后面的返回值返回给调用处
 * 返回值：也就是方法执行后最终产生的数据结果，必须与方法名称前面的返回值类型 保持对应
 * <p>
 * 方法的三种调用格式：
 * 1：单独调用：方法名称（参数）
 * 2：打印调用： System.out.println();
 * 3：赋值调用：
 */

public class methodDefine {
}
